// Дезоксирибонуклеиновая кислота, ДНК является основной молекулой хранения информации в биологических системах.
// Он состоит из четырех оснований нуклеиновых кислот гуанина("G"), цитозина("C"), аденина("A") и тимина("T").

// Рибонуклеиновая кислота, РНК, является основной молекулой - мессенджером в клетках.
// РНК немного отличается от ДНК своей химической структурой и не содержит тимина.В РНК тимин заменен другой нуклеиновой
// кислотой урацилом("U").

// Создайте функцию, которая переводит данную строку ДНК в РНК.

// Например:
// "GCAT"  =>  "GCAU"

function DNAtoRNA(dna) {}

let arr = "GTCAT";
let array = arr.split("");
console.log(array.indexOf("T"));
