// Напишите функцию, persistence, которая принимает положительный параметр numи возвращает его мультипликативное постоянство,
// то есть количество раз, которое вы должны умножить цифры, numпока не дойдете до одной цифры.

// Например (Ввод -> Вывод):

// 39 --> 3 (because 3*9 = 27, 2*7 = 14, 1*4 = 4 and 4 has only one digit)
// 999 --> 4 (because 9*9*9 = 729, 7*2*9 = 126, 1*2*6 = 12, and finally 1*2 = 2)
// 4 --> 0 (because 4 is already a one-digit number)

function persistence(num) {
    let s = 1;
  while (num%10>=1) {
    
  }
}